/*****************************************************************************
 * Module    : Configs
 * File      : config_define.h
 * Function  : 定义用户参数常量
 *****************************************************************************/
#ifndef CONFIG_DEFINE_H
#define CONFIG_DEFINE_H

/*****************************************************************************
 * Module    : FLASH大小定义
 *****************************************************************************/
#define FSIZE_1M                       0x100000
#define FSIZE_2M                       0x200000
#define FSIZE_512K                     0x80000
#define FSIZE_256K                     0x40000
#define FSIZE_128K                     0x20000

/*****************************************************************************
 * Module    : FOTA升级方式选择列表
 *****************************************************************************/
#define AB_FOT_TYPE_PACK                1   //FOTA压缩升级（代码做压缩处理，升级完成需做解压才可正常运行）
#define AB_FOT_TYPE_NORMAL              2   //FOTA非压缩升级（代码完全双备份，不做压缩处理，升级完成可直接运行）

#endif //CONFIG_DEFINE_H
