/*****************************************************************************
 * Module    : Configs
 * File      : config_define.h
 * Function  : 定义用户参数常量
 *****************************************************************************/
#ifndef CONFIG_DEFINE_H
#define CONFIG_DEFINE_H

/*****************************************************************************
 * Module    : FLASH大小定义
 *****************************************************************************/
#define FSIZE_1M                       0x100000
#define FSIZE_2M                       0x200000
#define FSIZE_512K                     0x80000
#define FSIZE_256K                     0x40000
#define FSIZE_128K                     0x20000

#endif //CONFIG_DEFINE_H
